#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "3fd9d8e246da48df265a2b56c6a6a214" -> "78c74c851457b257fe3d63712f624bd1"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "f98d32ef9e1e209a481def328949afc3" -> "659572cb0e2270c36951034d39368607"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "11f935a16b96181b5f1d60b533a5244e" -> "707c5962b436ef81e1f34e5c906a6b39"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8dfbde83d9bf9635cc2193603b784e20" -> "0b9a793dd6cfc496748bf65f6a2f2802"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "a59a67f4f6b68dc1f16dc51d4d190c73" -> "bd73891b80a70a67c98e815994d2748e"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "dfd74caf97dd029a0271a1d87e0a5334" -> "8d3024405db7d06e1c65596cdba14e50"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "cbf1eec6057e6d8b46c230cd1e943655" -> "5fd773197aaa048424b97a73ea71bd73"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "87752ff805b25a46eeb2bbc23a8838ca" -> "cc81b46fcaf562c9911d160ad21ee182"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "0f9a2e52a579c7b07c08a12e9a7265d2" -> "2f39896e6b02c163d887c166b279aa13"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "f45863c38e435d983abec4a4d679a2a8" -> "56240af6f2742b9110cbeb21ced5d7f5"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3f2109d6d262256255a07a6af1de532d" -> "f7ec26a9f2b35896a677cbfe5c633b6d"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "6e9f730a70967c6322be08b4426a76e1" -> "157ca51ab387ac3e94a7a972fa1b54fa"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "c167a9068e55f5c918a34a973de0a1ee" -> "d6db23382f4b571b8e84b076c78d577a"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "bec63d2b002c7a5d40a5f63854535c1b" -> "bf615134cec0881f950cac85d1a006b1"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "c9bb8b943ba0395ac02e8af4007400bb" -> "a86754ad74659e8d7d9acdd58e196515"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "34a83bc43fc9bf85beff704b890b544b" -> "e1989a63cd2ad05b8312ef94b9c769de"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f3c9c0f610f9b6930eca6932ac507fde" -> "2b83066fcfb0835d6c409add715abecf"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "95c0c6db0db31b750b5f63a71a1dc0da" -> "c60c5fd6285869f7307ea0c2bfc1597d"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "b85092f35e25bec659083eadbc29afed" -> "b7fa99c69e16142344633cff133d049c"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "f41897f87448f72dfe418df6dbbbb62c" -> "6f1f5e703e240b661658d5386f178dd6"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "825ebda657d1f5f435b82b1df4bfb47c" -> "e2c507c761b4c2a234f777b0fdfeeac3"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "841a340e2969777842f6bcf9ae1909a6" -> "0dacd4417cd3e2c9e79bcb135b026f4b"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "d4dc24a982673669115af458c04db206" -> "caab5108c0e8ba6f9fb678d57e424059"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "64f56bb13e451ce4d349bccaf6a996e4" -> "86da2254acaf8741de25f79a003bd284"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6850a38fab0a26a248459c42e76206ca" -> "7f5db26650ebfe1c41fb13b5d4384b1a"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "0ed216389cc49084a9b9926be4cab436" -> "d6b41834b8e3a3e4e59a07837239df35"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "a32a014813b70da72dc073aac79413cc" -> "d68d8675c5eb569aed60f8819e6bc7f6"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7e2a84615c2f77e3e20248495aba237a" -> "1f02e17c1d982afd9fc363e9b26488f0"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "4d9002d1db480f54a67e19e3cf69aeec" -> "542adc347fb0c9d0bebd92f0b0fcb4df"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "048f2fa6c2eaebe03e456125336380da" -> "96c597abc2ff67f0fa466d80506f9ece"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "942c10cc404adb0f22c8cc3fe44dc9bf" -> "7f80183301d5cd11e4ca6e531ba9850c"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "97549c484694aa579fe8a864459cec7e" -> "b3a691eebe373628e5291724b9d0636c"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "e2a5ec3983efa9ac1572e4032263dd77" -> "25ff26ccb0a253f46d40320dd7799128"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "6bcacef4498c40b184b74ccda2deaf22" -> "0f752e43bcf123cc21be01145b028a54"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "e88b19c2499f6ef1a97a722c66f83d42" -> "443fccff49e463a3d85560be844f46d2"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "d3fa3dd06a94784d79906f688d8c97a1" -> "b3753d146a818100a8e9a0685741a918"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "26d5f2876d9575af3dfbe21efb3c6bfb" -> "55cbc073ac9971405234b4d3cc6ceedf"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "394bfb21615993dbbae624a27baec5e4" -> "054986370bea4c235f272c2c34dd07a7"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "eed8fd2ba6e0b0964f5468cd349864a1" -> "4d5d30e13fc913b75bb9e41aa1d271f9"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "182e3a90e15667ab0466b3faa8180bf7" -> "5beb0aabe44383253bebce6b0700db44"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "270478b4340359e7c2772c85809e55fe" -> "ef7a8140ef0306ec38ac09338c8d90b6"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "48f99cf2abe811a0a9146c5a4cd59618" -> "7930ce866881114830e24db62562b908"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4779926d16b7cf2ef5ea6fc6f221d8a6" -> "158dd24dc769e361b2dc967cfcb3d985"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGr/mwjOLYX0LQRqh2gNgdS1rB+PQND0Jy15RpC+jc=" -> "tB0p7TNrJ//EZ5nTaKdJvHs5Stq4N+h3CucYneIIM4Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "Vs7SjePrS8gY8XSNu+lYHctfGM5sAYDjKdHTRw5ufsM=" -> "zeHWSriZi29pPo5INtNFTCmmm97iP7rdWwGCpnyDFvo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "VcF1T8MPsERT7W10lMu5WTVx2BEqNfuIZVNoRwZkvhg=" -> "H3YT78tJ+0Sfb3iq+dqP6xshafplDvY9NUGfPxfA0fI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "S6nGKT7DuSNL9X0QvZbGqL6061WKlPFxmqZPSqm3UQ0=" -> "EvquYHhwhp+TePZLWvEYYvukoFukQDlTAED8fPfCY/E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "gZn3mNzqb+Z2Ulnu/AaH0nd0QhDFANjFDuB3Wkk+SnA=" -> "BH/XpHjTaj2ml7kJ/updvZ8QxT083Dbrw4FUVLXfFdM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "QBARFicV8aMsMejbusiB9tG4ss0eGJ33eT7u6h6oerc=" -> "39qTMCWLM65IODP1JDapYinwTCOZBnvOofeCozk6fpw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "LuVHQbNLqw5R0luyu2wMatebbGD8k41A4YiCLoGdIsU=" -> "UHKXKQj7rd/wbJJCK6IqhHe4cDElZReFxOQa6z8/GXo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "RjbQ7qmaPGGxzia459HD/nhp6oKglMLdMxVRIiOZm1g=" -> "ACDo7sbMRNgPRh+CAUyHmm5g+4f5MRcaGAxe3c9Oed0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "eUHMr65V/2Q7ICHoHVWmrmof2r2xrhDscnxG6GjboPs=" -> "Rbjcj11AP4lOvg8OVKkuQDhajGpl15P4czwHSjDRvFU="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "/5+K7GTvHKWBGKLRKjQF+XA3DPHe6mqPH4lVOkk9Ai8=" -> "HCXEgQ2S1EQvHLkPuPXvqIQSP3reppP4N3bDo3nYG5o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "s0s/xS64v+7MfGSHE8NBzVZELpRogJkYgW2Ly3SXaOY=" -> "8XlsBz+ecfYPgqFjuhSXkXJxxRU2LKaMMOGks1gk2fg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "WvvxCG2MBHXb58Qdjy3O+kB4eV67Dyn2nZAbG/dLjaU=" -> "e1Fav57jNqDtCmj0xVXKHln61/+GR43lWmH2Tgazvik="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "WfSX6RJaW4ENU6xP/P/gpy4yRv6ospmLEqrdJxdxFZI=" -> "81+GXQ7OfyMSnPV+paIBXqq2IRSO1sus6x5pO91mEvw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "4AkT9JE2Xe+AMDnHrwdGCddqk9LO+yhLfETqOAqBFV0=" -> "XuhZ5OhJbZgaDsJL7O4ePflc7LRL9Oz/PZRmBTCJ7zk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "hMSKal/wJ1XwkUbECOGvT56THAbHdXqVO3g8n4ZxNVM=" -> "33YaCrEAnMC76Tm7IwPszIM5Mq/nZ6i0r/t/RBvtBwA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "cEfGDPexcle4umaBCmkzzvwMPWE5Hxg4m7Ub8tpbM1k=" -> "3ntOjHTr/oxMOrJbv7dxqedy7m5a4rg0ROAEF6wQkB4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hn9if487roM4UaqV+Atnyxi683F/qi/PC3PFLux90DU=" -> "FcnW48BBOvhiGDAgDUc0syLHf0V11m8ch9B/KZ7+ZtA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-01T20:43:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "CS/UZkEjhXDDR+YkZmTcn3k0NOLU6Ncp+IZUHMdCYkM=" -> "/4itXwndMHJy40Wf10R7NAqvKZqxtrk7dQaPjCgDMtk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "3Ccu5198aKGRv5n99K6tb51vB6VfGP6r4GPbsqBBhg8=" -> "VEhTX7AXLIB8W7dfTkQC8xiCOSC0x2PQwYE2I4S1qVc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "iWRK/WvqG7zteJa3TGBaYf/6Uc/MJDjdONKMUW7UEVg=" -> "W8SQW874cX9dxJPQhQgBuE65n8CFhMYT9U+Oia5+uQg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3DxJQse/usODcSM62/ng7/NDSTMAXSKE6t8EV84IG7A=" -> "I5tZW6DpPkVNqaWUFkQ6C5r4qbghE4ckKAG9mXhAkZk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "nIxmvcsGnEQj/3JikzTho5uvSolB1kgGHBr6vnkvRSk=" -> "uVlyJfLZ1/ZDhQOp2Tnfvs0A78k+wEk2T6HOsXHwK6E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "o61Qn/k1HZpmwEXNfVxVVXZ9y5CNoH8+hND8nyR8xIc=" -> "CExquk8J/i/iAeadEMMSHRpIibOSp4jdbgJz+h7h9O4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "uRg1n9vvr+qzEUyGMLU2DlRWURCVCHQPLLQgKVfefkQ=" -> "IdTB3rGgXeWVYEZ/RMPZHKyRN9SLJEOyLMDm/cHw3bc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "BxE/oLkR7+ssQWkKuoCZhyjdQj2zXHgXHce6vWwcv4k=" -> "fomz7L7ua+F5FdqV+m2YO7+xsZScq2C37OyawWV9DLs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "daKXo+d0SnGXXJELltf5+0KF9qu3Pi5xAJyVPrPpy0o=" -> "Rng6qhQ+A1812SMBup7kqlywS2PDO8jhZjUAq0vK+ew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "WVVP6bbzFbybG/b5c8xfc1Hz10S0mcAFDdybPn3SJU8=" -> "dqaPu+4+JMOpHunV6j0tymc8C4asb90LaW9EQvspiEQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "FtFycq+75wH7WmejM0EfQg7UuSbTutqXJwsvBl+foKY=" -> "VE5HKAUzcTtA/6daRZFXF6ZkpUObvmgQkuSFc2lbDCs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "DhVn4RBj9XpQ3oHcKcD+yYvhXpDQBRlIBGf2fxWChuY=" -> "E3VWgzxNHx7vKFvL3rjR2/1p2yQSpTjYyuyxd6ZYKd8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "8jMpFs8EvfaQMhLwOp/nDbcjT5Bx//4ayLRX5ZpmI2I=" -> "uFlQkCZNMorMtkT4UJ+OTh76fgW9vosmGJ8COO2YQLk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "nkSUJZg+ARrrCv1yFQ20VJk1pmcxOEb4UOuo3Hyyhc4=" -> "2c2dKHua0UAU91IAJ+MkiznB0KHQV5rZ8g+vadYz3l0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gDKR3dicxdeoZRaod9aXDiIjmqpD9I2qxiQkn0H82MQ=" -> "q60EvoSAyCsNatA4KjQeFoE0kJx9myv7C4ZWibO0vPk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mYWGtyI5Lqv3jrUzu/sr+7dWU8ZLr5/4KcXrgxV64Iw=" -> "70zu7UtOwWAhl1GDsqHt3nvuq54HOMFgaweAKGUY+Is="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "e6eVu1PC03Kv1ti843nF7zO70gQSkgR0LE5s6g3azmU=" -> "kscfl2Eq9wRORUpnrZrhgmOmgoUCHkhFPDsxAYsPZSU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "luU1ZGPaN9Hf9KTPtentAC5C9f2eyqaA1kTiN7m9N1s=" -> "+yJfBFPOepftsgPNNPtS7jtwXNmXBtqFVjit1wa1oio="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "j1aYXpmP9J12jikw2d0hF3R4/CC+t42xQ/+spuvQXLI=" -> "2HVoFk1VKdFMEW7Qs4w8WQRwX9hAYQwqAEoKOlb7Qxk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "lE5qhPbfP0aBmYZHtLGUszigfzXAWryafFEU6CZm8eo=" -> "DDXzltaehp79HlOg+hQu/DZSqIwaR6IIIR+PMSZa/CI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "LCDdX0VpXrfCDv7lmh9iFHtr5/18DIrngpiNukwwv18=" -> "IMw0cX0kv5vx3UAjE5v8Lo+JgsF3xvLViKjSCeanogw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "RI9iFlD471X1/y3qRpSAHEBTEyTCyVFD9y7ucpdt+2I=" -> "vuAMlQiaRxxBdwBiC9yCAc9nI03BvQZrL0jaiFCBJFU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "j0CwaifjbZS5bozE7Bt01THRus6golSg3MrNam7at6I=" -> "egjK8wf/WXFl7krrNvbr+YHoKXgeg/AlhciX9vX7HCo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "gsZVR5KW35jFJMuJtHrW6fKkct6IQRmQNl/taBmM2LQ=" -> "T42Gb2UVNnbQMPwps531keux0VpOsmV0PZbNdKdfoBQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "7MuPFDFN6Ic8GPoxF88DfO9O1To1XufVVd3FV55Ld8k=" -> "WHz2kGz3OOZFOk45yLYiWbSLK0WVRB3Tjwx8v5QBn5w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-31T22:46:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xy4ll8" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-31T22:46:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-31T22:49:20Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 87 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*